tests/MultipleFlow.yml
config:
  target: 'https://reqres.in'
  phases:
    - duration: 40
      arrivalRate: 5
      maxVusers: 30
scenarios:

  - flow:
    - get:
        url: "/api/unknown"
      expect:
           - statusCode: 200

  - flow:
  - get:
      url: "/api/users?page=2"
    expect:
         - statusCode: 200

  - flow:
  - get:
      url: "/api/unknown/2"
    expect:
         - statusCode: 200

  - flow:
  - get:
      url: "/api/users/2"
    expect:
         - statusCode: 200

  - flow:
  - get:
      url: "/api/unknown/23"
    expect:
         - statusCode: 404
  
  - flow:
  - get:
      url: "/api/users/23"
    expect:
         - statusCode: 404