tests/PatchUpdateUser.yml
config:
    target: "https://reqres.in"
    phases:
      - duration: 30
        arrivalCount: 5
        maxVusers: 30

scenarios:
    - name: "Register Successful"
      flow:
        - patch:
            url: "/api/users/2"
            json:                
                  name: "morpheus"
                  job: "zion resident"
            expect:
               - statusCode: 200